import random
mysonglist = ["可爱女人","星晴","黑色幽默","龙卷风","反方向的钟","爱在西元前","简单爱","开不了口","上海一九四三","安静","半岛铁盒","暗号","分裂","回到过去","晴天","东风破","你听得到",
              '她的睫毛', "七里香", "借口","搁浅","园游会","夜曲","发如雪","黑色毛衣","枫","珊瑚海","一路向北","夜的第七章","听妈妈的话","千里之外","退后","心雨","白色风车","迷迭香","菊花台"
              ,"彩虹","青花瓷","蒲公英的约定","最长的电影","给我一首歌的时间","花海","说好的幸福呢","兰亭序","时光机","稻香","说了再见","烟花易冷","我落泪·情绪零碎","爱的飞行日记","红尘客栈","大笨钟"
              ,"算什么男人","手写的从前","听见下雨的声音","不该","告白气球","爱情废柴","还在流浪","最伟大的作品","说好不哭","红颜如霜","不爱我就拉倒","错过的烟火","粉色海洋","倒影","我是如此的相信"]
songchosen = random.choice(mysonglist)

audiencelist = ["陈丽宁","杨凯心","唐朝","李宇辰","萧亦纯","王徐文豪","陶斯微","江未","邱子馨","李欣语","胡桢欣","孙浩博","鄢熠菲","夏梦薇","占宇涵","吴佳雨"]







personchosen = random.choice(audiencelist)
print("接下来给",personchosen,"唱",songchosen)